In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.372860  0.332322
1  bar    one -0.104155  0.495074
2  foo    two  0.423699  1.490432
3  bar  three  0.137255 -0.215962
4  foo    two -0.776748 -1.474512
5  bar    two  0.294884 -0.034431
6  foo    one  0.579078  0.827222
7  foo  three -0.034069  0.445892

### 分组统计个数

In [2]:
grouped = df.groupby('A')
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [3]:
grouped = df.groupby(['A','B'])
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

### 自定义返回值

In [4]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a列'
    else:
        return 'b列'
grouped = df.groupby(get_letter_type,axis = 1)
grouped.count()

   a列  b列
0   1   3
1   1   3
2   1   3
3   1   3
4   1   3
5   1   3
6   1   3
7   1   3

In [5]:
grouped.count().iloc[0] #看下第一行的

a列    1
b列    3
Name: 0, dtype: int64

### 按特定级别分组

In [6]:
s = pd.Series([1,2,3,1,2,4],[8,7,5,8,7,5])
s

8    1
7    2
5    3
8    1
7    2
5    4
dtype: int64

In [7]:
grouped = s.groupby(level = 0) #这个值代表多层索引级别（如果轴是多索引的，则按特定级别分组）

In [8]:
grouped.first()

5    3
7    2
8    1
dtype: int64

In [9]:
grouped.last()

5    4
7    2
8    1
dtype: int64

In [10]:
grouped.sum() #求和

5    7
7    4
8    2
dtype: int64

In [11]:
grouped = s.groupby(level = 0,sort =False) #不让它排序

In [12]:
grouped.first()

8    1
7    2
5    3
dtype: int64

In [13]:
grouped.last()

8    1
7    2
5    4
dtype: int64

### 只关注固定某列

In [14]:
df2 = pd.DataFrame({'X':['A','B','A','B'],'Y':[1,2,5,4]})
df2

   X  Y
0  A  1
1  B  2
2  A  5
3  B  4

In [15]:
df2.groupby(['X']).get_group('A')

   X  Y
0  A  1
2  A  5

In [16]:
df2.groupby(['X']).get_group('B')

   X  Y
1  B  2
3  B  4

### 多层索引

In [17]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [18]:
index = pd.MultiIndex.from_arrays(arrays,names = ['first','second']) #构造多层索引

In [19]:
s = pd.Series(np.random.randn(8),index = index)
s

first  second
bar    one      -0.814641
       two      -0.887968
baz    one       0.160664
       two       0.975161
foo    one       2.384231
       two       0.239179
qux    one      -1.110790
       two      -0.839399
dtype: float64

In [20]:
grouped = s.groupby(level =0)
grouped.sum()

first
bar   -1.702609
baz    1.135825
foo    2.623410
qux   -1.950189
dtype: float64

In [21]:
grouped = s.groupby(level = 1)
grouped.sum()

second
one    0.619465
two   -0.513027
dtype: float64

In [22]:
grouped = s.groupby(level = 'first') #也可以按索引名称
grouped.sum()

first
bar   -1.702609
baz    1.135825
foo    2.623410
qux   -1.950189
dtype: float64

### 和numpy结合进行求和

In [23]:
df

     A      B         C         D
0  foo    one -1.372860  0.332322
1  bar    one -0.104155  0.495074
2  foo    two  0.423699  1.490432
3  bar  three  0.137255 -0.215962
4  foo    two -0.776748 -1.474512
5  bar    two  0.294884 -0.034431
6  foo    one  0.579078  0.827222
7  foo  three -0.034069  0.445892

In [24]:
grouped = df.groupby(['A','B'])
grouped.aggregate(np.sum) #以AB为键进行的求和操作

                  C         D
A   B
bar one   -0.104155  0.495074
    three  0.137255 -0.215962
    two    0.294884 -0.034431
foo one   -0.793781  1.159545
    three -0.034069  0.445892
    two   -0.353049  0.015920

In [25]:
grouped = df.groupby(['A','B'],as_index = False) #和上面的一样，只不过是全部版
grouped.aggregate(np.sum)

     A      B         C         D
0  bar    one -0.104155  0.495074
1  bar  three  0.137255 -0.215962
2  bar    two  0.294884 -0.034431
3  foo    one -0.793781  1.159545
4  foo  three -0.034069  0.445892
5  foo    two -0.353049  0.015920

### 重置索引

In [26]:
df_new = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)},
                      index = ['i0','i1','i2','i3','i4','i5','i6','i7'])
df_new

      A      B         C         D
i0  foo    one -0.287781 -0.270540
i1  bar    one  0.611847 -0.047005
i2  foo    two  1.386190  0.144489
i3  bar  three  0.043549 -2.287263
i4  foo    two -1.248219  0.179452
i5  bar    two -0.034176 -0.316077
i6  foo    one  1.045438  0.228940
i7  foo  three  0.844583  1.227583

In [27]:
df_new.reset_index()  #重新生成0-..的索引

  index    A      B         C         D
0    i0  foo    one -0.287781 -0.270540
1    i1  bar    one  0.611847 -0.047005
2    i2  foo    two  1.386190  0.144489
3    i3  bar  three  0.043549 -2.287263
4    i4  foo    two -1.248219  0.179452
5    i5  bar    two -0.034176 -0.316077
6    i6  foo    one  1.045438  0.228940
7    i7  foo  three  0.844583  1.227583

### 看一下各种组合一共出现多少次

In [28]:
grouped = df_new.groupby(['A','B'])
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

### 看各种统计值

In [29]:
grouped.describe().head()

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0  0.611847       NaN  0.611847  0.611847  0.611847  0.611847
    three   1.0  0.043549       NaN  0.043549  0.043549  0.043549  0.043549
    two     1.0 -0.034176       NaN -0.034176 -0.034176 -0.034176 -0.034176
foo one     2.0  0.378829  0.942728 -0.287781  0.045524  0.378829  0.712133
    three   1.0  0.844583       NaN  0.844583  0.844583  0.844583  0.844583

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    0.611847   1.0 -0.047005       NaN -0.047005 -0.047005 -0.047005
    three  0.043549   1.0 -2.287263       NaN -2.287263 -2.287263 -2.287263
    two   -0.034176   1.0 -0.316077       NaN -0.316077 -0.316077 -0.316077
foo one    1.045438   2.0 -0.020800  0.353185 -0.270540 -0.145670 -0.020800
    three  0.844583   1.0  1.227583       NaN  1.227583  1.227583  1.227583


                75%       max
A   B
bar one   -0.047005 -0.047005
    three -2.287263 -2.287263
    two   -0.316077 -0.316077
foo one    0.104070  0.228940
    three  1.227583  1.227583

### 统计很多个特性

In [30]:
grouped = df_new.groupby('A')
grouped['C'].agg([np.sum,np.mean,np.std])

          sum      mean       std
A
bar  0.621219  0.207073  0.352692
foo  1.740211  0.348042  1.091213